import os
import json
import time

from func.vk_group import dial, send


FILE_NAME = 'mailing.json'
START = 750
STOP = 850
TEXT = ''

# СБ 18:45 / 750-824
# '''
# Привет! Наши студенты и ВКонтакте запустили совместный проект «Мемодельня».

# С нами уже более 30К человек. И это всего за месяц!

# Вступай в наши ряды и поддержи студентов СПбГУ ♥️

# Создавай локальные мемы с друзьями и участвуй в конкурсе 🔥

# https://vk.com/memedelnya_app#mailing8
# '''
# С нами уже более 30К мемоделов. И это всего за месяц!
# Только за декабрь 30К человек сделали локальные мемы с друзьями
# Уже сейчас ты можешь использовать галерею мемов, добавлять подписи и фото.


# СБ 18:30 / 650-750
# '''
# Привет! Наши студенты и ВКонтакте запустили совместный проект.

# Название «Мемодельня» (https://vk.com/memedelnya_app#mailing7) говорит само за себя.

# Используй любимые мемы и быстро создавай локальные 🌵

# Поддержи своих студентов: зайди, попробуй и оставь отзыв!
# '''

# СБ 18:15 / 550-650
# '''
# Студенты СПбГУ здесь и сейчас меняют вселенную!!

# Совместно с ВКонтакте и межпланетарным институтом картиночек с котиками мы объявляем запуск ВКонтакте-приложения МЕМОДЕЛЬНЯ!!
# https://vk.com/memedelnya_app#mailing6

# 😧 Используй готовые шаблоны
# 🤠 Делай мемы с друзьями
# 😍 Найди свой любимый мем

# А ТАКЖЕ ДЛЯ ОСОБО ЛЕНИВЫХ МЫ СДЕЛАЛИ АВТОМЕМ
# Отправь картинку и получи готовый мем от ВЫСШЕГО ИСКУССТВЕННОГО ИНТЕЛЛЕКТА МЕМОВ
# http://vk.me/memedelnya

# Присоединяйся
# '''

# СБ 18:00 / 450 - 550
# '''
# Только для самых ленивых и смешных!

#  🔥 МЕМОДЕЛЬНЯ 🔥

# Куча крутых идей в голове, но лень сидеть часами и создавать мем? У нас сделаешь это за пару минут!

# https://vk.com/memedelnya_app#mailing5

# В голове сидит задумка, но не знаешь как оформить? Наши шаблоны спасут тебя!

# Я точно сделаю смешно? Конечно. И в пару кликов? В этом и суть.
# '''

# ПТ 19:00 / 350-450
# '''
# Срочные новости!

# Трамп на совете федерации поручил направить рыночную руку экономики на финансирования нового проекта СПбГУ.

# Именно тот студент СПбГУ, который сделает лучший мем про свой факультет в Мемодельне (https://vk.com/memedelnya_app#mailing4) получит народную любовь и поборется за главный приз недели!

# Все мемы будут публиковаться в главном мемном паблике СПбГУ Пурум Пурум: https://vk.com/apememes
# '''

# ПТ 18:45 / 250-350
# '''
# Студенты СПбГУ здесь и сейчас меняют вселенную!!

# Совместно с ВКонтакте и межпланетарным институтом картиночек с котиками мы объявляем запуск ВКонтакте-приложения МЕМОДЕЛЬНЯ!!
# https://vk.com/memedelnya_app#mailing3

# 😧 Используй готовые шаблоны
# 🤠 Делай мемы с друзьями
# 😍 Найди свой любимый мем

# А ТАКЖЕ ДЛЯ ОСОБО ЛЕНИВЫХ МЫ СДЕЛАЛИ АВТОМЕМ
# Отправь картинку и получи готовый мем от ВЫСШЕГО ИСКУССТВЕННОГО ИНТЕЛЛЕКТА МЕМОВ
# http://vk.me/memedelnya

# Присоединяйся
# '''

# ПТ 17:30 / 150-250
# '''
# Привет!

# Хочешь сделать мем с другом, но всё лень?
# Мы решили твою проблему! Делай мемы прямо во ВКонтакте: https://vk.com/memedelnya_app#mailing2

# Тысячи готовых шаблонов ждут тебя. Добавляй свои, используй любимые мемы за основу!
# '''

# ПТ 17:15 / 50-150
# '''
# ! АТЕНТИОН !
# Новый спец проект Гайд ПУНК совместно с ВКонтакте
# ‼️ Мемодельня ‼️
# Делай мемы и картинки прямо во ВКонтакте: https://vk.com/memedelnya_app#mailing1

# Используй готовые шаблоны, вспомни любимые мемы и сделай свой мем про друзей ☺️


# А ТАКЖЕ СОВМЕСТНО С ИНСТИТУТОМ НЕЙРОСЕТЕВЫХ ТЕХНОЛОГИЙ МЫ ЗАПУСКАЕМ АВТОГЕНЕРАТОР МЕМОВ
# Отправь любое фото нашему боту: http://vk.me/memedelnya

# 🎉🎉
# '''


ids = []

if os.path.exists(FILE_NAME):
	with open(FILE_NAME, 'r') as file:
		ids = json.loads(file.read())


if len(ids):
	print(ids[START:STOP])

	# for el in ids[START:STOP]:
	# 	try:
	# 		send(el, TEXT) # 140420515
	# 	except:
	# 		print('ERROR', el)
	# 	else:
	# 		time.sleep(1)
	# 		print('SEND', el)

else:
	ids = dial()

	with open(FILE_NAME, 'w') as file:
		print(json.dumps(ids), file=file)

	print('SAVE', len(ids))