<?php
include('sys/main.tpl');
?>

<style type="text/css">
	@media all and (max-width: 480px) {
		hr {width: 100%;}
}

	@media all and (min-width: 480px) {
		hr {width: 75%}
}
</style>

<ul>Обучение
	<li>СПбГУ Прикладная Математика - Процессы управления
	<li>31 лицей г. Челябинск
</ul>
<hr>
<ul>Область деятельности
	<li>Python Backend
	<li>Web Full-stuck
	<li>Raspberry Pi, Arduino
</ul>
<hr>
<ul>Интересы
	<li>Artificial Intelligence, Machine Vision, Machine Learning
	<li>Роботизированные автоматизированные системы
	<li>Боты Телеграмм, ВКонтакте
	<li>Биржа
</ul>
<hr>
<ul>Проекты
	<li>Категайзер текстов
Используя технологию Google Word2Vec и собственноручная прописанная модель нейронной сети
	<li>Система умного дома
Интернет вещей, Big Data, взаимосвязь различных средств и умная комплексная взаимо работа
	<li>Универсальный сайт
Социальная сеть с множеством других сервисов, которые тесно между собой взаимодействуют
	<li>Телеграмм бот "Дневник криптотрейдеров"
Параллельный анализ нескольких бирж, ведение канала, получение сигналов из ботов и приватных каналов, анализ синтаксиса, распознания текста на сложных изображениях, прогнозирование
	<li>Twitter бот
Имитация поведения человека в социальной сети, постинг, лайки, репосты, анализ взаимности, анализ популярности, автонакрутка
</ul>

	<li>Прогноз биржи Газпром
	<li>Парсер синтаксиса
	<li>Корпус слов
	<li>Сайт Газеты
	<li>Сайт Рекламного агентства
Тонко подстраиваемый кабинет администратора
<hr>
<ul>Достижения
	<li>Первое место на региональном уровне Всероссийской Олимпиады Школьников
	<li>Диплом III степени МФТИ
	<li>Первые места в региональных IT конкурсах
</ul>

</body>
</html>